web/unit_4/final_project_proposal.org
#+TITLE:Propuesta de proyecto final
#+AUTHOR:Antonio Ochoa

* Definición

  Administración de citas entre alumnos y profesionistas del Instituto
  Tecnológico de Morelia.

  Desarrollar una aplicación web en la que los alumnos del Instituto
  Tecnológico de Morelia puedan registrarse y agendar citas con los profesionistas
  registrados y disponibles para ello. Contará principalmente de dos tipos de
  profesionistas: piscólogos y nutriólogos.

* Alcances
** Alumno
   - Registrarse en el sistema
     - Matrícula
     - Correo electrónico
     - Teléfono
     - Nombre
     - Apellido paterno
     - Apellido materno
     - Género
     - Semestre cursando
     - Contraseña
     - Nombre de padre o tutor
     - Apellido paterno del padre o tutor
     - Apellido materno del padre o tutor
     - Teléfono del padre o tutor
     - Correo electrónico del padre o tutor
     - Carrera que cursa
   - Ver datos personales
   - Modificar datos personales
   - Agendar cita
   - Ver citas agendadas
   - Cancelar cita agendada
** Profesionista
   - Ver datos personales
   - Ver citas agendadas por los alumnos
   - Cancelar cita
** Administrador
   - Dar de alta profesionistas
    - RFC
    - Correo electrónico
    - Teléfono
    - Nombre
    - Apellido materno
    - Apellido paterno
    - Puesto
    - Hora de entrada
    - Hora de salida
    - Salón
    - Contraseña
   - Dar de baja profesionistas
   - Modificar datos de profesionistas
   - Ver información de los profesionistas
   - Dar de baja alumnos
   - Modificar datos de alumnos
   - Ver información de los alumnos
   - Ver citas agendadas entre alumnos y profesionistas
   - Cancelar citas agendadas
** Otros
   - Todos los usuarios tendrán que autenticarse para poder iniciar sesión
   - Todos los usuarios podrán cerrar su sesión cuando lo deseen
   - Hora de entrada y salida de profesionistas
     - Los profesionistas contarán con horario de entrada y salida, horario
       en el cual los alumnos podrán agendar cita siempre y cuando la hora y el lugar
       estén disponibles.
   - El alumno podrá modificar sus datos personales a excepción de su matrícula
* Sugerencias del profesor
  - Bandera para cita (realizada o cancelada)
  - Estadísticas para saber
